<!--  PRACTICA: Pagina con etiquetas para mejorar el contenido de un texto -->

<!-- Definicion de cabecera -->
<!DOCTYPE html>
<html>
<head>
	<!--- Metadatos -->
	<meta charset="utf-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	<meta name="description" content="Desarrollo de una pagina con contenido de tipo texto y algunas etiquetas para mejorar el contenido" />
	<meta name="author" content="0draS0" />
	<meta name="keywords" content="html, texto, parrafo, etiquetas" />

	<!-- Titulo visible en la pestaña del navegador -->
	<title>Texto con etiquetas</title>
</head>
<body>
	<!--Contenido del documento-->
	<h1 align="center">Etiquetas para textos</h1>
	<br>
	Las siguientes etiquetas te pueden ayudar a mejorar la estructura de tus textos, destacarlos y hacer m&aacute;s atractiva tu p&aacute;gina.
	<br> 

	<!-- Cursiva -->
		<p>Para insertar texto en <i>cursiva</i>, la etiqueta de apertura y cierre es: &lt;i&gt;Tu texto va aqu&iacute;&lt;/i&gt;</p>
	<br>

	<!-- Enfasis -->
		<p>Para insertar texto con <em>&eacute;nfasis</em>, la etiqueta de apertura y cierre es: &lt;em&gt;Tu texto va aqu&iacute;&lt;/em&gt;
			<br>
			Marca una diferencia en la fuerza que se quiere dar a una palabra o frase sobre el texto completo.
		</p>

	<!-- Cite -->
	<br>
		<p>La etiqueta &lt;cite&gt; &lt;/cite&gt; se recomienda para referenciar una obra creativa, no el nombre de una persona. Es similar a &lt;em&gt;.
		<br>
		Ejemplo: <cite>
				  Fight Club
				 </cite> 
				 (movie, 1999).
		</p>

	<!-- Blockquote -->
	<br>
		<p>La etiqueta &lt;blockquote&gt; &lt;/blockquote&gt; muestra la cita de un p&aacute;rrafo largo. Es recomendable introducir el texto en un p&aacute;rrafo y colocar de manera manual las comillas. Aqu&iacute;, la etiqueta &lt;cite&gt; se utiliza como un atributo de la etiqueta de bloque.
		<br>
		Ejemplo: <blockquote cite="https://www.ejemplos.co/15-ejemplos-de-citas-textuales/#ixzz7Yu0LF7h4">
					<p>"Pero las mujeres pasan siempre en grupos. Me escondí y esperé . La Mauricia pasó con su botijo y la arrastré. Cada día se escapó después para encontrarme, temblando por el miedo al marido, a veces temprano y a veces tarde, a aquel lugar que yo conozco. En la casa que hice por mi mano, para vivir con mi mujer, en la misión del gringo noruego vive con su marido."</p>
		         </blockquote> 
		</p>
	<br>

	<!-- q -->
		<p>Para definir una cita corta, utilizamos la etiqueta &lt;q&gt; &lt;/q&gt;.
			<br>
			Ejemplo :<q>Céntrate hacia dónde quieres ir, no en lo que temes.</q>
		</p>
	<br>

	<!-- b -->
		<p>Para insertar texto en <b>negritas</b>, la etiqueta de apertura y cierre es: &lt;b&gt;Tu texto va aqu&iacute;&lt;/b&gt;</p>
	<br>

	<!-- strong -->
		<p>Para insertar texto con <strong>&eacute;nfasis en negritas</strong>, la etiqueta de apertura y cierre es: &lt;strong&gt;Tu texto va aqu&iacute;&lt;/strong&gt;
			<br>
			Marca una diferencia en la fuerza que se quiere dar a una palabra o frase sobre el texto completo.
		</p>
	<br>

	<!-- big -->
		<p>Para insertar un texto de <big>mayor tamaño</big> entre tus l&iacute;neas, la etiqueta de apertura y cierre es: &lt;big&gt;Tu texto va aqu&iacute;&lt;/big&gt;</p>
	<br>

	<!-- small -->
		<p>Para insertar un texto de <small>menor tamaño</small> entre tus l&iacute;neas, la etiqueta de apertura y cierre es: &lt;small&gt;Tu texto va aqu&iacute;&lt;/small&gt;</p>
	<br>
	
	<!-- sup -->
		<p>Para indicar un super&iacute;ndice en el texto, utilizamos la etiqueta &lt;sup&gt;Tu texto va aqu&iacute;&lt;/sup&gt;, lo puedes ver principalmente en f&oacute;rmulas matem&aacute;ticas como x<sup>2</sup> </p>
	<br>

	<!-- sub -->
		<p>Para indicar un sub&iacute;ndice en el texto, utilizamos la etiqueta &lt;sub&gt;Tu texto va aqu&iacute;&lt;/sub&gt;, lo puedes ver principalmente en f&oacute;rmulas de Qu&iacute;mica como C<sub>12</sub>H<sub>22</sub>O<sub>11</sub> </p>
	<br>

	<!-- center -->
		<p>Colocar un texto en el centro con la etiqueta &lt;center&gt;Tu texto va aqu&iacute;&lt;/center&gt;. También puedes implementar la atributo <i>aling</i> en la etiqueta &lt;p&gt;.
			<br>
			<center>Texto con etiqueta &lt;center&gt;</center>
		</p>
		<p align="center"> Etiqueta con atributo</p>

	<br>
</body>
</html>
