<!DOCTYPE html> 
<html lang="es">
    <head>
        <!-- Definicion de cabecera -->
        <title>WEB 1.0, 2.0, 3.0 y 4.0</title>
        <!--- Metadatos -->
            <meta charset="utf-8" />
            <meta name="description" content="Diferencias entre la web 1, 2, 3, 4" />
            <meta name="author" content="0draS0" />
            <meta name="keywords" content="Tipos de web, caracteristicas de las web" />   
    </head>
    <!-- Ejemplo de sitio con atributos en cada etiqueta -->
    <body style = "text-align: justify; background-color:#FFE8D6; font-size: 14px;">
        <h1 style ="color: #f1faee; background:#CB997E; padding:15px; text-align: center; font-family: Monospace"> WEB 1.0, 2.0, 3.0 y 4.0 </h1>   <!-- Titulo de la pagina, enmarcado --> 
        <br>
        <br>
        <br>
        <h2 style= "color:#6B705C; text-align: center; font-family: Helvetica;">WEB 1.0</h2> <!-- SECCION 1 -->
            <p>Se conoce como la web "est&aacute;tica" debido a que no hay interacci&oacute;n entre los usuarios con el contenido de los sitios, los usuarios finales son pasivos (solo ten&iacute;an permitido la lectura). Exist&iacute;an personas encargadas de generar contenido de manera específica para cada tema con un solo tipo de p&uacute;blico.Su tecnolog&iacute;a principal estaba basada en: <em>Flash, Javascript y HTML.</em>
        <br>
                Se considera la forma m&aacute;s b&aacute;sica que existe de navegadores de solo texto. <strong>Su principal objetivo era difundir información</strong>
        <br>
                Las pautas de accesibilidad eran 14: </p>
            <ol>
                <li>Proporcione alternativas equivalentes para el contenido visual y auditivo.</li>
                <li>No se base s&oacute;lo en el color.</li>
                <li>Utilice marcadores y hojas de estilo y hágalo apropiadamente.</li>
                <li>Identifique el idioma usado.</li>
                <li>Cree tablas que se transformen correctamente.</li>
                <li>Aseg&uacute;rese de que las páginas que incorporen nuevas tecnolog&iacute;as se transformen correctamente.</li>
                <li>Asegure al usuario el control sobre los cambios de los contenidos tempo-dependientes.</li>
                <li>Asegure la accesibilidad directa de las interfaces incrustadas.</li>
                <li>Diseñe para la independencia del dispositivo.</li>
                <li>Utilice soluciones provisionales.</li>
                <li>Utilice las tecnolog&iacute;as y pautas W3C.</li>
                <li>Proporcione informaci&oacute;n de contexto y orientaci&oacute;n.</li>
                <li>Proporcione mecanismos claros de navegaci&oacute;n.</li>
                <li>Aseg&uacute;rese de que los documentos sean claros y simples.</li>
           </ol>
       <div style="text-align: center;">
        <figure> <!-- Imagen -->
            <img src="https://i1.wp.com/www.sopitas.com/wp-content/uploads/2013/06/pagina_cern_1.jpg" width="400" height="200" alt="Primera p&aacute;gina web">
            <figcaption><i>Primera p&aacute;gina web</i></figcaption>
        </figure>
       </div>
       <br>
       <br>
       <hr>
       <br>
       <h2 style= "color:#6B705C; text-align: center; font-family: Helvetica;">WEB 2.0</h2> <!-- SECCION 2 -->
            <p>Comprende aquellos sitios que facilitan compartir informaci&oacute;n. Estos permiten a los usuarios interactuar entre s&iacute; adem&aacute;s de colaborar como creadores de contenido. Los usuarios dejan de ser simples receptores pasivos para convertirse en usuarios
activos, produciendo una modificaci&oacute;n de las conductas, usos y competencias de los internautas. Algunos ejemplos de esta red son: <b>los servicios de red social, wikis y blogs.</b> Sus principales caracter&iacute;sticas son: ser din&aacute;mica, interactiva y principalmente de lectura-escritura.
       <br>
            <strong>La web 2.0 no es m&aacute;s que la colaboraci&oacute;n y el intercambio &aacute;gil de informaci&oacute;n entre los usuarios de una comunidad o red social. </strong>
        <br>
            Con esta nueva tecnolog&iacute;a los profesores comienzan a dejar trabajos colaborativos donde los alumnos participan basados en los contenidos aportados por el profesor. 
        <br>
            La comunicaci&oacute;n entre empresas y clientes, se hace por medio de chats que pueden contactarse en forma sincr&oacute;nica solicitando información </p>
       <div style="text-align: center;">
        <figure> <!-- Imagen -->
            <img src="https://cdn.pixabay.com/photo/2015/10/21/08/22/media-998990_960_720.jpg" width="300" height="200" alt="Ejemplos de redes sociales">
            <figcaption><i>Redes sociales importantes</i></figcaption>
        </figure>
       </div>
       <br>
       <br>
       <hr>
       <br>
       <h2 style= "color:#6B705C; text-align: center; font-family: Helvetica;">WEB 3.0</h2> <!-- SECCION 3 -->
            <blockquote> El t&eacute;rmino web 3.0 apareci&oacute; por primera vez en 2006 en un art&iacute;culo de Zeldman, cr&iacute;tico de la web 2.0. Esta web fue operativa desde el 2010 </blockquote>
            <p>Son aplicaciones web conectadas, a fin de enriquecer la experiencia de las personas; a esto agrega conocimiento del contexto en la web geoespacial, la autonom&iacute;a respecto del navegador y la construcci&oacute;n de la web sem&aacute;ntica. La web 3.0 es conocida como la <big>web semántica</big> porque utiliza de forma m&aacute;s eficiente de los datos: <tt>data web</tt>. Es inter-operativa y el usuario tiene el control para hacer los cambios que desee modificando directamente las bases de datos. La web sem&aacute;ntica incluye <tt>metadatos</tt> sem&aacute;nticos u ontol&oacute;gicos (que describen los contenidos y las relaciones entre los datos) para que
puedan ser rastreados por sistemas de procesamiento.
        <br>
                Ofrecer un flujo de información y de contenidos adaptados a nuestros gustos y preferencias. Las <small>redes sociales</small> pasar&iacute;an a ser ahora, <small>redes o comunidades de aprendizaje</small>. Es una red que promueve el acceso de las personas a la informaci&oacute;n, sin importar del medio de acceso, la interacci&oacute;n sirve para lograr resultados, no solo el hecho de compartir información. </p>
       <div style="text-align: center;">
        <figure> <!-- Imagen -->
             <img src="https://cdn.pixabay.com/photo/2016/06/03/13/57/digital-marketing-1433427_960_720.jpg" width="300" height="200" alt="Datos estadisticos como ejemplo de metadatos"> 
             <figcaption><i>Informaci&oacute;n de transparencia de empresas</i></figcaption>
        </figure>
       </div>
       <br>
       <br>
       <hr>
       <br>
       <h2 style= "color:#6B705C; text-align: center; font-family: Helvetica;">WEB 4.0</h2> <!-- SECCION 4 -->
            <p>Es el pr&oacute;ximo gran avance y se centrar&aacute; en ofrecer un comportamiento m&aacute;s inteligente, m&aacute;s predictivo, de modo que podamos, con s&oacute;lo realizar una afirmaci&oacute;n o petici&oacute;n, poner en marcha un conjunto de acciones que tendr&aacute;n como resultando aquello que pedimos o decimos.
        <br>
                La web 4.0 permite la computaci&oacute;n cognitiva. A trav&eacute;s de ordenadores se almacenan en la <b>nube</b> permitiendo, no s&oacute;lo que cualquier dispositivo con conexi&oacute;n a internet nos ayude a aprovecharnos de ellos.
        <br>
                Empresas como <b>Google, Microsoft o Facebook</b>, entre otras, est&aacute;n desarrollando nuevos sistemas que gracias al <q>Deep Learning y Machine Learning</q> ser&aacute;n capaces de procesar informaci&oacute;n de forma similar a como lo har&iacute;a el cerebro humano. Tenemos los avances que los asistentes de voz est&aacute;n logrando. <q>Siri, Google Now o Cortana</q> entienden cada vez de forma m&aacute;s precisa y correcta lo que les decimos o solicitamos.
        <br>
                La experiencia del usuario es elemental al diseñar o crear plataformas, productos y servicios. Se trata de una web activa.
</p>
       <div style="text-align: center;">
        <figure> <!-- Imagen -->
            <img src="https://cdn.pixabay.com/photo/2017/04/23/19/30/earth-2254769_960_720.jpg" width="300" height="200" alt="El futuro es hoy">
            <figcaption><i>Infinidad de informaci&oacute;n circulando por todo el mundo</i></figcaption>
        </figure>
       </div>   
       <br>
       <br>
       <hr>
       <br>
       <h2 style= "color:#6B705C; text-align: center; font-family: Helvetica;">CUADRO COMPARATIVO</h2> <!-- SECCION 5 -->
       <!-- Inicio de tabla -->
       <table style="font-size: 12px; border-collapse: collapse; border: 2px solid; border-color: #B7B7A4; margin-left: auto; margin-right: auto; width: 1000px; height: 150px;">
        <caption>Comparaci&oacute;n entre las diferentes webs</caption>
            <tr style="background-color: #DDBEA9; border: 2px solid; border-color: #B7B7A4; "> <!-- Fila -->
                <th style="text-align: center;"> &nbsp; </th>
                <th style="text-align: center;"> 1.0 </th>
                <th style="text-align: center;"> 2.0 </th>
                <th style="text-align: center;"> 3.0 </th>
                <th style="text-align: center;"> 4.0 </th>
            </tr>
            <tr> <!-- Fila -->
                <td style="text-align: center; border: 2px solid; border-color: #B7B7A4;"> CARACTERISTICAS </td>
                <td> <ul>
                       <li>Primitiva</li>
                       <li>Estatica</li>
                       <li>Secuencial</li>
                     </ul> </td>
                <td>  <ul>
                       <li>Dinamica</li>
                       <li>Interactiva</li>
                       <li>De lectura y escritura</li>
                     </ul> </td>
                <td>  <ul>
                       <li>Búsquedas inteligentes</li>
                       <li>Mayor rapidez</li>
                       <li>Contenido libre</li>
                     </ul> </td>
                <td> <ul>
                       <li>Uso de la información del contexto</li>
                       <li>Nuevo modelo de interacción con el usuario</li>
                     </ul> </td>
            </tr>
            <tr> <!-- Fila -->
                <td style="text-align: center; border: 2px solid; border-color: #B7B7A4;"> TECNOLOGIA </td>
                    <td> <ul type ="square">
                           <li>Flash</li>
                           <li>Javascript</li>
                           <li>HTML</li>
                         </ul>
                    </td>
                    <td>  <ul type ="square">
                           <li>Ajax</li>
                           <li>RSS</li>
                           <li>XML,XHTML,DHTML</li>
                         </ul> </td>
                    <td>  <ul type ="square">
                           <li>WolframAlpha</li>
                           <li>ResortSuite Web3.0</li>
                         </ul> </td>
                    <td> <ul type ="square">
                           <li>Internet</li>
                           <li>Plataformas de redes sociales</li>
                         </ul> </td>
            </tr>
            <tr> <!-- Fila -->
                <td style="text-align: center; border: 2px solid; border-color: #B7B7A4;"> SIGNIFICADO </td> <!-- Columna de titulo -->
                    <td> La web 1.0 es la forma m&aacute;s b&aacute;sica que existe de navegadores de solo texto. </td>
                    <td> La web 2.0 no es m&aacute;s que la colaboraci&oacute;n y el intercambio &aacute;gil de informaci&oacute;n entre los usuarios de una comunidad o red social.</td>
                    <td> La web 3.0 son aplicaciones web conectadas a aplicaciones web,a fin de enriquecer la experiencia de la persona.</td>
                    <td> La web 4.0 permite la computaci&oacute;n cognitiva. A trav&eacute;s de ordenadores se almacenan en la nube permitiendo, no s&oacute;lo que cualquier dispositivo con conexi&oacute;n a internet nos ayude a aprovecharnos de ellos.</td>   
            </tr>
            <tr> <!-- Fila -->
            <td style="text-align: center; border: 2px solid; border-color: #B7B7A4;"> OBJETIVO </td> <!-- Columna de titulo -->
                    <td> <i>Difundir informaci&oacute;n</i> </td>
                    <td> <i>Interacci&oacute;n en redes sociales</i></td>
                    <td> <i>Ofrecer un flujo de informaci&oacute;n y de contenidos adaptados a nuestros gustos y preferencias</i></td>
                    <td> <i>Permitir adelantarse situaciones cotidianas</i></td>
            </tr>
            <tr> <!-- Fila -->
            <td style="text-align: center; border: 2px solid; border-color: #B7B7A4;"> VISTA DESDE: ESCUELA </td> <!-- Columna de titulo -->
                    <td> Era para un p&uacute;blico en concreto donde exclusivamente, profesores sub&iacute;an contenido </td>
                    <td> Comenzaba el uso de plantillas. Los procesos de trabajo eran m&aacute;s colaborativos</td>
                    <td> Las redes sociales se vuelven <q>redes de aprendizaje</q></td>
                    <td> Se moviliza el aprendizaje con la interacci&oacute;n entre alumnos y profesores, resolviendo problemas m&aacute;s reales</td>
            </tr>
            <tr> <!-- Fila -->
            <td style="text-align: center; border: 2px solid; border-color: #B7B7A4;"> ACCESIBILIDAD </td> <!-- Columna de titulo -->
                    <td> Proporcione alternativas equivalentes para el contenido visual y auditivo. </td>
                    <td> Perceptibilidad</td>
                    <td> Su estado actual es <q>borrador de trabajo</q> (W3C Editor's Draft 18 November 2020) y se espera que esté finalizado después de 2022.</td>
                    <td> &nbsp;</td>
            </tr>
            <tr> <!-- Fila -->
            <td style="text-align: center; border: 2px solid; border-color: #B7B7A4;"> VISTA DESDE: PADRES </td> <!-- Columna de titulo -->
                    <td> Una guarder&iacute;a para cuidar a los niños.</td>
                    <td> Guarder&iacute;a</td>
                    <td> Un lugar para poder aprender.</td>
                    <td> Preparaci&oacute;n para entrar al mundo de las finanzas.</td>
            </tr>
            <tr> <!-- Fila -->
            <td style="text-align: center; border: 2px solid; border-color: #B7B7A4;"> VISTA DESDE: ALUMNOS </td> <!-- Columna de titulo -->
                    <td> Medio de informaci&oacute;n</td>
                    <td> Medio de informaci&oacute;n y medio de comunicaci&oacute;n</td>
                    <td> Medio de informaci&oacute;n y comunicaci&oacute;n especializado</td>
                    <td> Medio de informaci&oacute;n y medio de comunicaci&oacute;n</td>
            </tr>
            <tr> <!-- Fila -->
            <td style="text-align: center; border: 2px solid; border-color: #B7B7A4;"> VISTA DESDE: EMPRESAS </td> <!-- Columna de titulo -->
                    <td> La comunicaci&oacute;n de los clientes con las empresas se realiza utilizando formularios de contacto.</td>
                    <td> La comunicaci&oacute;n entre empresas y clientes, se hace por medio de chats que pueden contactarse en forma sincr&oacute;nica solicitando informaci&oacute;n.</td>
                    <td> La web permite construir un mensaje publicitario que ser&aacute; difundido mediante una tecnolog&iacute;a digital.</td>
                    <td> Las redes sociales y buscadores tienen la informaci&oacute;n necesaria para focalizar mensajes publicitarios.</td>
            </tr>
            <tr> <!-- Fila -->
            <td style="text-align: center; border: 2px solid; border-color: #B7B7A4;"> VISTA DESDE: PROFESORES </td> <!-- Columna de titulo -->
                    <td> Los docentes ahora dan informaci&oacute;n generalmente de manera pasiva</td>
                    <td> Empiezan a dejar el trabajo colaborativo</td>
                    <td> Los maestros deben adquirir las competencias necesarias para saber enfrentarse al mundo digital y globalizado.</td>
                    <td> Todos son profesores pues todos informamos y aprendemos.</td>
            </tr>
            <tr> <!-- Fila --> 
            <td style="text-align: center; border: 2px solid; border-color: #B7B7A4;"> TIPO DE COMUNICACION </td> <!-- Columna de titulo -->
                    <td> Son de solo lectura, donde el usuario no puede interactuar con el contenido de la p&aacute;gina (respuestas, citas textuales, etc.)Estando limitado a lo que el web-master sube a la p&aacute;gina</td>
                    <td> Los usuarios dejan de ser simples receptores pasivos para convertirse en usuarios activos, produciendo una modificaci&oacute;n de las conductas, usos y competencias de los internautas</td>
                    <td> Es una red que promueve el acceso de las personas a la informaci&oacute;n, sin importar del medio de acceso, la interacci&oacute;n sirve para lograr resultados, no solo el hecho de compartir <i>información</i></td>
                    <td> La experiencia del usuario es elemental al diseñar o crear plataformas, productos y servicios. Se trata de una web activa.</td>
            </tr>
            <tr> <!-- Fila -->
            <td style="text-align: center; border: 2px solid; border-color: #B7B7A4;"> ARQUITECTURA </td> <!-- Columna de titulo -->
                    <td> <ul>
                            <li>Cliente Web/DNS</li>
                            <li>Servidor DNS</li>
                            <li>Servidor Web</li>
                          </ul> </td>
                    <td> <ul>
                            <li>Cliente Web/DNS</li>
                            <li>Servidor DNS</li>
                            <li>Servidor Web</li>
                            <li>Contenedor de aplicaciones web</li>
                          </ul></td>
                    <td> A.I como transferencia de conocimiento de disciplinas hist&oacute;ricas como la biblioteconom&iacute;a y la arquitectura sobre la web.</td>
                    <td> Nuevos modelos de comunicaci&oacute;n m&aacute;quina-m&aacute;quina (M2M)</td>
            </tr>
       </table>
     </body>
</html>